# Customer Shared - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-shared-staging/runs/run-G7nRnVPgLJfBF8sd

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.cockroach_cluster.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a]
module.database.cockroach_database.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer]
module.database.aws_ssm_parameter.default: Refreshing state... [id=customer-shared-staging-customer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.database.aws_ssm_parameter.default must be replaced
-/+ resource "aws_ssm_parameter" "default" {
      ~ arn            = "arn:aws:ssm:ap-southeast-1:514472330244:parameter/customer-shared-staging-customer" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "customer-shared-staging-customer" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      ~ name           = "customer-shared-staging-customer" -> "customer-shared-staging-customer-cluster-id" # forces replacement
        tags           = {
            "domain"        = "customer"
            "environment"   = "customer-shared-staging"
            "resource"      = "customer-shared"
            "resource_type" = "database"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*